<?php

// 1. Создайте переменную boolean типа с названием $b содержащую значение "ложь".
// # Момент на видео "2.4 Типы данных в PHP, написание комментариев" - 01:38
// $b = 


// 2. Создайте переменную boolean типа с названием $isLessonCompleted и поместите в нее значение "истина".
// # Момент на видео "2.4 Типы данных в PHP, написание комментариев" - 01:38


// 3. Создайте переменные с названием $number1 и $number2. И поместите в них два разных целых числа от 0 до 9 (значения выберите самостоятельно).
// # Момент на видео "2.4 Типы данных в PHP, написание комментариев" - 03:56


// 4. Выведите сумму чисел 3 и 4, вместе с типом получившегося значения.
// # Момент на видео "2.4 Типы данных в PHP, написание комментариев" - 02:54
// # Функция var_dump() выводит не только само значение, но и его тип


// 5. Создайте переменную $x, и поместите в него число с плавающей точкой 7.3.
// # Момент на видео "2.4 Типы данных в PHP, написание комментариев" - 06:59


// 6. Создайте переменную $result, и поместите в нее результат сложения переменных $x и $number1. Выведите получившееся значение и его тип.
// # используйте var_dump, обратите внимание на тип данных


// 7. Создайте переменные $line1, $line2, $line3 и поместите в них три разные строки.
// # Момент на видео "2.4 Типы данных в PHP, написание комментариев" - 09:45


// 8. Создайте переменную $line представляющую собой конкатенацию этих трех переменных в указанном порядке $line1, $line3, $line2, и выведите получившийся результат.
// # Здесь нужно заглянуть чуть наперед и узнать что такое конкатенация и как она реализуется.
// # Конкатенация - это склеивание (сложение) строк, когда к одной строке пристыковывают (конкатенируют) другую
// # в php это оператор . (точка)


