<?php
// Одномерные Массивы

// 1. Заполните массив $numbers с тремя значениями - любыми целыми числами
// # Момент на видео "3.1 Массивы в PHP" - 02:58
$number = [];


// 2. Заполните массив $lines с тремя значениями - любыми словами
// # Момент на видео "3.1 Массивы в PHP" - 03:26
$lines = [];


// 3. Заполните массив $one с одним значением равным 8, ключом этого значения сделайте число 34
// # Момент на видео "3.1 Массивы в PHP" - 06:17
$one = [];


// 4. Даны следующие слова и описание к ним: мышь - это животное грызун, конь - скачет по полям, хрюшка - кушает желуди
// Создайте массив словарь $dictionary, содержащий три элемента. Ключом элементам массива сделайте - имя животного, а значением - его описание
// # Момент на видео "3.1 Массивы в PHP" - 07:42
$dictionary = [];


// 5. Теперь, не очень хорошо, когда ключи массива содержат символы, не относящиеся к английскому языку
// переименуйте ключи в массиве $dictionary, укажите вместо них английские названия животных
// # Создайте новый массив, поместив его в туже переменную
$dictionary = [];


// 6. Выведите массив $dictionary, известной вам функцией
// # функция var_dump


// 7. А теперь выведите отдельно описание мышки из массива $dictionary
// # Момент на видео "3.1 Массивы в PHP" - 10:26


// 8. А выведите описание хрюшки из массива $dictionary


// 9. А выведите третий элемент из массива $numbers


// 10. Мне не нравится это число, поместите в третий элемент массива $numbers число 3.14
// И выведите его, чтобы убедиться, что там теперь действительно это новое число
// # Момент на видео "3.1 Массивы в PHP" - 11:59


// 11. Создайте массив $days, состоящий из дней недели, сделайте ключи этого массива равными номеру дня в неделе от 1 до 7,
// а значениями сделайте строку с названием дня, 1 - Понедельник, 2 - Вторник и т.д.
// # Если переопределить числовой ключ, то затем php будет продолжать их назначение от установленного значения
$days = [];
