<?php
// Многомерные массивы

// 1. Создайте массив $matrix, состоящих из целых чисел от 1 до 9 в виде матрицы 3х3
// # Момент на видео "3.1 Массивы в PHP" - 12:58


// 2. Выведите центральный элемент (на строке 2 в столбце 2) из этой матрицы
// # Момент на видео "3.1 Массивы в PHP" - 15:23

// 3. Выведите последний элемент в первой строке из этой матрицы


// 4. Посчитайте и выведите сумму элементов из этой матрицы, расположенных ниже и левее диагонали 1 5 9


// 5. Создайте массив, $users описывающий следующих пользователей
// - Никита, 29 лет, плотник
// - Вася, 13 лет, футболист
// - Николай Николаевич, 77 лет, профессиональный игрок в DotA
// Массив должен быть ассоциативным, каждый элемент должен содержать поля: имя, возраст, профессия
// # Момент на видео "3.1 Массивы в PHP" - 12:58


// 6. Добавьте в массив users еще одного участника: Виталий, 30 лет, программист
// # Момент на видео "3.1 Массивы в PHP" - 16:55


// 7. Создайте массив, описывающий загадочного пользователя ($mysteriousUser) - с тем же набором полей, что и в массиве $users
// В качестве имени укажите ему имя 3-го пользователя из массива $users
// В качестве возраста, выберите ему возраст первого пользователя из массива $users
// Профессию укажите из 2-го пользователя
// И выведите его на экран с помощью функции var_dump
